## Plan Result (Staging - TerraformPlanApply)




<pre><code>Plan: 11 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.staging-apps-public-dns.azurerm_dns_a_record.this[&#34;libra-gateway&#34;]
  * module.staging-apps-public-dns.azurerm_dns_cname_record.this[&#34;crimeportal&#34;]
  * module.staging-apps-public-dns.azurerm_dns_cname_record.this[&#34;darts&#34;]
  * module.staging-apps-public-dns.azurerm_dns_cname_record.this[&#34;glimr-preprod&#34;]
  * module.staging-apps-public-dns.azurerm_dns_cname_record.this[&#34;glimr-release&#34;]
  * module.staging-apps-public-dns.azurerm_dns_cname_record.this[&#34;glimr-training&#34;]
  * module.staging-apps-public-dns.azurerm_dns_cname_record.this[&#34;juror&#34;]
  * module.staging-apps-public-dns.azurerm_dns_cname_record.this[&#34;juror-public&#34;]
  * module.staging-apps-public-dns.azurerm_dns_cname_record.this[&#34;sdrs&#34;]
  * module.staging-apps-public-dns.azurerm_dns_zone.zone
  * module.staging-apps-public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.staging-apps-public-dns.azurerm_dns_a_record.this["libra-gateway"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "libra-gateway"
      + records             = [
          + "185.230.153.229",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps-public-dns.azurerm_dns_cname_record.this["crimeportal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "crimeportal"
      + record              = "hmcts-nle-int-cfgpbgagf9eedcar.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps-public-dns.azurerm_dns_cname_record.this["darts"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts"
      + record              = "sdshmcts-stg-abfwhrf8g0btcqhe.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps-public-dns.azurerm_dns_cname_record.this["glimr-preprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "glimr-preprod"
      + record              = "hmcts-nle-int-cfgpbgagf9eedcar.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps-public-dns.azurerm_dns_cname_record.this["glimr-release"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "glimr-release"
      + record              = "hmcts-nle-int-cfgpbgagf9eedcar.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps-public-dns.azurerm_dns_cname_record.this["glimr-training"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "glimr-training"
      + record              = "hmcts-nle-int-cfgpbgagf9eedcar.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps-public-dns.azurerm_dns_cname_record.this["juror"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror"
      + record              = "sdshmcts-stg-abfwhrf8g0btcqhe.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps-public-dns.azurerm_dns_cname_record.this["juror-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-public"
      + record              = "sdshmcts-stg-abfwhrf8g0btcqhe.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps-public-dns.azurerm_dns_cname_record.this["sdrs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sdrs"
      + record              = "hmcts-nle-int-cfgpbgagf9eedcar.z01.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.apps.hmcts.net"
    }

  # module.staging-apps-public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.apps.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record (known after apply)
    }

  # module.staging-apps-public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1885,"Program":"tfcmt","SHA1":"","Target":"Staging - TerraformPlanApply","Vars":{}} -->